In [84]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [9]:
df = pd.read_csv('weather_data.csv')
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [7]:
df.temperature

0    32.0
1     NaN
2    28.0
3     NaN
4    32.0
5     NaN
6     NaN
7    34.0
8    40.0
Name: temperature, dtype: float64

In [60]:
df.temperature.isna()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
7    False
8    False
Name: temperature, dtype: bool

In [61]:
x = []
for idx, val in enumerate(df.temperature):
    if isinstance(val, float) and val != val:
        x.append(idx)

In [62]:
x

[1, 3, 5, 6]

In [63]:
ddff = df.loc[x,:]
ddff

        day  temperature  windspeed  event
1  1/4/2017          NaN        9.0  Sunny
3  1/6/2017          NaN        7.0    NaN
5  1/8/2017          NaN        NaN  Sunny
6  1/9/2017          NaN        NaN    NaN

In [38]:
type(df.loc[3, 'temperature'])

numpy.float64

In [36]:
df.loc[1,'temperature'] == df.loc[3, 'temperature']

False

In [39]:
xx = [3, 'rahi', 5.9, np.nan, 3]
xx

[3, 'rahi', 5.9, nan, 3]

In [46]:
isinstance(xx, list)

True

In [55]:
x= []
for idx,i in enumerate(xx):
    if isinstance(i, float) and i != i:
        x.append(idx)
        print(i)

nan

In [56]:
x

[3]

In [51]:
xx[x[0]]

nan

In [64]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [67]:
df.loc[df['event'] == 'Rain']

        day  temperature  windspeed event
0  1/1/2017         32.0        6.0  Rain
4  1/7/2017         32.0        NaN  Rain

In [68]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [72]:
p = df['event'] == 'Rain'

In [73]:
p

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
Name: event, dtype: bool

In [76]:
type(p)

pandas.core.series.Series

In [80]:
ol = pd.Series([True, True,False, True, False, True, False, True,True],name='bangla')
ol

0     True
1     True
2    False
3     True
4    False
5     True
6    False
7     True
8     True
Name: bangla, dtype: bool

In [86]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [87]:
dff = pd.read_csv('weather_by_cities.csv')
dff

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [91]:
grp = dff.groupby(by= 'city')

In [93]:
grp.get_group('mumbai').mean()

temperature    88.50
windspeed       9.25
dtype: float64

In [95]:
dff.groupby(by= 'city').temperature.mean()

city
mumbai      88.50
new york    32.25
paris       47.75
Name: temperature, dtype: float64

In [96]:
grp.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [97]:
grp.temperature.mean()

city
mumbai      88.50
new york    32.25
paris       47.75
Name: temperature, dtype: float64

In [115]:
grp.agg(['mean', 'median'])[['temperature', 'windspeed']]

         temperature        windspeed
                mean median      mean median
city
mumbai         88.50   88.5      9.25    8.5
new york       32.25   32.5      8.00    7.0
paris          47.75   47.5     12.75   11.5